Autodesk.Revit.DB.Analysis.CriticalPathCollector.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Analysis.CriticalPathCollector.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Analysis.CriticalPathCollector.GetCalculatedPressureDrop
Gets the calculated pressure drop of the network.
Remarks:
The calculated pressure drop is the total pressure loss value of all analytical segment on the critical path.
The value is often used to select the equipment.
Returns:
The pressure drop value in the internal Revit unit kg/(ft*s^2).
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathCollector.GetCalculatedFlow
Gets the calculated flow of the network.
Remarks:
The calculated flow is the maximum flow value of any analytical segment on the network, typically associated with the main branch.
Returns:
The flow value in the internal Revit unit ft^3/second.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathCollector.GetCriticalPathCollectorIterator
Gets the critical path iterator to traverse individual segment.
Returns:
The iterator that traverses the critical path.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathCollector.ToNetworkSegmentIds
Returns the list of analytical segment ids on the network critical path.
Returns:
The array of all analytical segment ids on the critical path.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathCollector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.CriticalPathCollector.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId)
Creates a new CriticalPathCollector that visits the analytical segments on the network critical path.
doc:
The document of the analytical network.
segmentId:
The analytical segment to identify the network. Note that this segment is not required to be on the critical path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The network segment id is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathCollector
This class is used to search and traverse the network analytical segments on the critical path.
Remarks:
The critcal path is a connected flow path that has the maximum pressure loss value on the network.
The associated flow and pressure loss values are often used to select the equipment size.
When this collector is constructed, the network is identified by one analytical segment seed.
User may get the CriticalPathIterator from the collector to traverse the analytical segment on
the critical path, in the sequence of their flow direction. Note that If the network contains
multiple hydraulically separated levels, the critical path traversal is focused on the same
hydraulic separation level as the seed segment.
Since:
2025